GUdaoxi/demo_qspi/LPTIM16_Timing/Drivers/FM33FH0xx_FL_Driver/Inc/fm33fh0xx_fl_flash.h
/**
  *******************************************************************************************************
  * @file    fm33fh0xx_fl_flash.h
  * @author  FMSH Application Team
  * @brief   Head file of FLASH FL Module
  *******************************************************************************************************
  * @attention    
  * Copyright 2024 SHANGHAI FUDAN MICROELECTRONICS GROUP CO., LTD.(FUDAN MICRO.)
  *        
  * Redistribution and use in source and binary forms, with or without modification,
  * are permitted provided that the following conditions are met: 
  *    
  * 1. Redistributions of source code must retain the above copyright notice, 
  *    this list of conditions and the following disclaimer.
  *    
  * 2. Redistributions in binary form must reproduce the above copyright notice,
  *    this list of conditions and the following disclaimer in the documentation
  *    and/or other materials provided with the distribution.
  *    
  * 3. Neither the name of the copyright holder nor the names of its contributors 
  *    may be used to endorse or promote products derived from this software without
  *    specific prior written permission.
  *    
  * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS"AS IS"
  * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
  * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE   
  * ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE
  * LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
  * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
  * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED
  * AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT   
  * (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS
  * SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.    
  *
  *******************************************************************************************************
  */


/* Define to prevent recursive inclusion---------------------------------------------------------------*/
#ifndef __FM33FH0XX_FL_FLASH_H
#define __FM33FH0XX_FL_FLASH_H

#ifdef __cplusplus
extern "C" {
#endif
/* Includes -------------------------------------------------------------------------------------------*/
#include "fm33fh0xx_fl_def.h"
/** @addtogroup FM33FH0XX_FL_Driver
  * @{
  */
/* Exported types -------------------------------------------------------------------------------------*/
/** @defgroup FLASH_FL_ES_INIT FLASH Exported Init structures
  * @{
  */

/**
  * @brief FL FLASH Init Sturcture definition
  */
/**
  * @}
  */
/* Exported constants ---------------------------------------------------------------------------------*/
/** @defgroup FLASH_FL_Exported_Constants FLASH Exported Constants
  * @{
  */

#define    FLASH_RDCR_DATA_WAIT_Pos                                 (2U)
#define    FLASH_RDCR_DATA_WAIT_Msk                                 (0x7U << FLASH_RDCR_DATA_WAIT_Pos)
#define    FLASH_RDCR_DATA_WAIT                                     FLASH_RDCR_DATA_WAIT_Msk

#define    FLASH_RDCR_CODE_WAIT_Pos                                 (0U)
#define    FLASH_RDCR_CODE_WAIT_Msk                                 (0x3U << FLASH_RDCR_CODE_WAIT_Pos)
#define    FLASH_RDCR_CODE_WAIT                                     FLASH_RDCR_CODE_WAIT_Msk

#define    FLASH_PFCR_EN_Pos                                        (0U)
#define    FLASH_PFCR_EN_Msk                                        (0x1U << FLASH_PFCR_EN_Pos)
#define    FLASH_PFCR_EN                                            FLASH_PFCR_EN_Msk
                                                                                                                                       
#define    FLASH_OPTBR_IWDTSLP_Pos                                  (31U)
#define    FLASH_OPTBR_IWDTSLP_Msk                                  (0x1U << FLASH_OPTBR_IWDTSLP_Pos)
#define    FLASH_OPTBR_IWDTSLP                                      FLASH_OPTBR_IWDTSLP_Msk

#define    FLASH_OPTBR_IWDTEN_Pos                                   (30U)
#define    FLASH_OPTBR_IWDTEN_Msk                                   (0x1U << FLASH_OPTBR_IWDTEN_Pos)
#define    FLASH_OPTBR_IWDTEN                                       FLASH_OPTBR_IWDTEN_Msk

#define    FLASH_OPTBR_DFDBRDPEN_Pos                                (4U)
#define    FLASH_OPTBR_DFDBRDPEN_Msk                                (0x3U << FLASH_OPTBR_DFDBRDPEN_Pos)
#define    FLASH_OPTBR_DFDBRDPEN                                    FLASH_OPTBR_DFDBRDPEN

#define    FLASH_OPTBR_ACLOCKEN_Pos                                 (2U)
#define    FLASH_OPTBR_ACLOCKEN_Msk                                 (0x3U << FLASH_OPTBR_ACLOCKEN_Pos)
#define    FLASH_OPTBR_ACLOCKEN                                     FLASH_OPTBR_ACLOCKEN_Msk

#define    FLASH_OPTBR_CFDBRDPEN_Pos                                (0U)
#define    FLASH_OPTBR_CFDBRDPEN_Msk                                (0x3U << FLASH_OPTBR_CFDBRDPEN_Pos)
#define    FLASH_OPTBR_CFDBRDPEN                                    FLASH_OPTBR_CFDBRDPEN_Msk

#define    FLASH_CEPCR_ERTYPE_Pos                                   (8U)
#define    FLASH_CEPCR_ERTYPE_Msk                                   (0x3U << FLASH_CEPCR_ERTYPE_Pos)
#define    FLASH_CEPCR_ERTYPE                                       FLASH_CEPCR_ERTYPE_Msk

#define    FLASH_CEPCR_PREQ_Pos                                     (1U)
#define    FLASH_CEPCR_PREQ_Msk                                     (0x1U << FLASH_CEPCR_PREQ_Pos)
#define    FLASH_CEPCR_PREQ                                         FLASH_CEPCR_PREQ_Msk

#define    FLASH_CEPCR_EREQ_Pos                                     (0U)
#define    FLASH_CEPCR_EREQ_Msk                                     (0x1U << FLASH_CEPCR_EREQ_Pos)
#define    FLASH_CEPCR_EREQ                                         FLASH_CEPCR_EREQ_Msk

#define    FLASH_CIER_LVIE_Pos                                      (12U)
#define    FLASH_CIER_LVIE_Msk                                      (0x1U << FLASH_CIER_LVIE_Pos)
#define    FLASH_CIER_LVIE                                          FLASH_CIER_LVIE_Msk

#define    FLASH_CIER_OPTIE_Pos                                     (11U)
#define    FLASH_CIER_OPTIE_Msk                                     (0x1U << FLASH_CIER_OPTIE_Pos)
#define    FLASH_CIER_OPTIE                                         FLASH_CIER_OPTIE_Msk

#define    FLASH_CIER_AUTHIE_Pos                                    (10U)
#define    FLASH_CIER_AUTHIE_Msk                                    (0x1U << FLASH_CIER_AUTHIE_Pos)
#define    FLASH_CIER_AUTHIE                                        FLASH_CIER_AUTHIE_Msk

#define    FLASH_CIER_KEYIE_Pos                                     (9U)
#define    FLASH_CIER_KEYIE_Msk                                     (0x1U << FLASH_CIER_KEYIE_Pos)
#define    FLASH_CIER_KEYIE                                         FLASH_CIER_KEYIE_Msk

