GUdaoxi/demo_qspi/LPTIM16_Timing/Drivers/FM33FH0xx_FL_Driver/Inc/fm33fh0xx_fl_flash.h
#define    FLASH_CIER_CKIE_Pos                                      (8U)
#define    FLASH_CIER_CKIE_Msk                                      (0x1U << FLASH_CIER_CKIE_Pos)
#define    FLASH_CIER_CKIE                                          FLASH_CIER_CKIE_Msk

#define    FLASH_CIER_PRDIE_Pos                                     (1U)
#define    FLASH_CIER_PRDIE_Msk                                     (0x1U << FLASH_CIER_PRDIE_Pos)
#define    FLASH_CIER_PRDIE                                         FLASH_CIER_PRDIE_Msk

#define    FLASH_CIER_ERDIE_Pos                                     (0U)
#define    FLASH_CIER_ERDIE_Msk                                     (0x1U << FLASH_CIER_ERDIE_Pos)
#define    FLASH_CIER_ERDIE                                         FLASH_CIER_ERDIE_Msk

#define    FLASH_CISR_CONF_Pos                                      (31U)
#define    FLASH_CISR_CONF_Msk                                      (0x1U << FLASH_CISR_CONF_Pos)
#define    FLASH_CISR_CONF                                          FLASH_CISR_CONF_Msk

#define    FLASH_CISR_KEYSTA_Pos                                    (17U)
#define    FLASH_CISR_KEYSTA_Msk                                    (0x7U << FLASH_CISR_KEYSTA_Pos)
#define    FLASH_CISR_KEYSTA                                        FLASH_CISR_KEYSTA_Msk

#define    FLASH_CISR_LVERR_Pos                                     (12U)
#define    FLASH_CISR_LVERR_Msk                                     (0x1U << FLASH_CISR_LVERR_Pos)
#define    FLASH_CISR_LVERR                                         FLASH_CISR_LVERR_Msk

#define    FLASH_CISR_OPTERR_Pos                                    (11U)
#define    FLASH_CISR_OPTERR_Msk                                    (0x1U << FLASH_CISR_OPTERR_Pos)
#define    FLASH_CISR_OPTERR                                        FLASH_CISR_OPTERR_Msk

#define    FLASH_CISR_AUTHERR_Pos                                   (10U)
#define    FLASH_CISR_AUTHERR_Msk                                   (0x1U << FLASH_CISR_AUTHERR_Pos)
#define    FLASH_CISR_AUTHERR                                       FLASH_CISR_AUTHERR_Msk

#define    FLASH_CISR_KEYERR_Pos                                    (9U)
#define    FLASH_CISR_KEYERR_Msk                                    (0x1U << FLASH_CISR_KEYERR_Pos)
#define    FLASH_CISR_KEYERR                                        FLASH_CISR_KEYERR_Msk

#define    FLASH_CISR_CKERR_Pos                                     (8U)
#define    FLASH_CISR_CKERR_Msk                                     (0x1U << FLASH_CISR_CKERR_Pos)
#define    FLASH_CISR_CKERR                                         FLASH_CISR_CKERR_Msk

#define    FLASH_CISR_PRD_Pos                                       (1U)
#define    FLASH_CISR_PRD_Msk                                       (0x1U << FLASH_CISR_PRD_Pos)
#define    FLASH_CISR_PRD                                           FLASH_CISR_PRD_Msk

#define    FLASH_CISR_ERD_Pos                                       (0U)
#define    FLASH_CISR_ERD_Msk                                       (0x1U << FLASH_CISR_ERD_Pos)
#define    FLASH_CISR_ERD                                           FLASH_CISR_ERD_Msk

#define    FLASH_ECCSR_DD_Pos                                       (31U)
#define    FLASH_ECCSR_DD_Msk                                       (0x1U << FLASH_ECCSR_DD_Pos)
#define    FLASH_ECCSR_DD                                           FLASH_ECCSR_DD_Msk

#define    FLASH_ECCSR_CD_Pos                                       (30U)
#define    FLASH_ECCSR_CD_Msk                                       (0x1U << FLASH_ECCSR_CD_Pos)
#define    FLASH_ECCSR_CD                                           FLASH_ECCSR_CD_Msk

#define    FLASH_ECCSR_DC_Pos                                       (28U)
#define    FLASH_ECCSR_DC_Msk                                       (0x1U << FLASH_ECCSR_DC_Pos)
#define    FLASH_ECCSR_DC                                           FLASH_ECCSR_DC_Msk

#define    FLASH_ECCSR_CC_Pos                                       (28U)
#define    FLASH_ECCSR_CC_Msk                                       (0x1U << FLASH_ECCSR_CC_Pos)
#define    FLASH_ECCSR_CC                                           FLASH_ECCSR_CC_Msk

#define    FLASH_ECCSR_BE_Pos                                       (27U)
#define    FLASH_ECCSR_BE_Msk                                       (0x1U << FLASH_ECCSR_BE_Pos)
#define    FLASH_ECCSR_BE                                            FLASH_ECCSR_BE_Msk

#define    FLASH_ECCIER_DDIE_Pos                                    (3U)
#define    FLASH_ECCIER_DDIE_Msk                                    (0x1U << FLASH_ECCIER_DDIE_Pos)
#define    FLASH_ECCIER_DDIE                                        FLASH_ECCIER_DDIE_Msk

#define    FLASH_ECCIER_CDIE_Pos                                    (2U)
#define    FLASH_ECCIER_CDIE_Msk                                    (0x1U << FLASH_ECCIER_CDIE_Pos)
#define    FLASH_ECCIER_CDIE                                        FLASH_ECCIER_CDIE_Msk

#define    FLASH_ECCIER_DCIE_Pos                                    (1U)
#define    FLASH_ECCIER_DCIE_Msk                                    (0x1U << FLASH_ECCIER_DCIE_Pos)
#define    FLASH_ECCIER_DCIE                                        FLASH_ECCIER_DCIE_Msk

#define    FLASH_ECCIER_CCIE_Pos                                    (0U)
#define    FLASH_ECCIER_CCIE_Msk                                    (0x1U << FLASH_ECCIER_CCIE_Pos)
#define    FLASH_ECCIER_CCIE                                        FLASH_ECCIER_CCIE_Msk

#define    FLASH_ECCEAR_DADDR_Pos                                   (20U)
#define    FLASH_ECCEAR_DADDR_Msk                                   (0xfffU << FLASH_ECCEAR_DADDR_Pos)
#define    FLASH_ECCEAR_DADDR                                       FLASH_ECCEAR_DADDR_Msk

#define    FLASH_ECCEAR_CADDR_Pos                                   (0U)
#define    FLASH_ECCEAR_CADDR_Msk                                   (0xffffU << FLASH_ECCEAR_CADDR_Pos)
#define    FLASH_ECCEAR_CADDR                                       FLASH_ECCEAR_CADDR_Msk

#define    FLASH_ECCCR_CECCR_Pos                                    (8U)
#define    FLASH_ECCCR_CECCR_Msk                                    (0xffU << FLASH_ECCCR_CECCR_Pos)
#define    FLASH_ECCCR_CECCR                                        FLASH_ECCCR_CECCR_Msk

#define    FLASH_ECCCR_DECCR_Pos                                    (0U)
#define    FLASH_ECCCR_DECCR_Msk                                    (0xffU << FLASH_ECCCR_DECCR_Pos)
#define    FLASH_ECCCR_DECCR                                        FLASH_ECCCR_DECCR_Msk

