GUdaoxi/demo_qspi/LPTIM16_Timing/Drivers/FM33FH0xx_FL_Driver/Inc/fm33fh0xx_fl_flash.h
#define    FL_FLASH_CODE_MAX_PAGE_NUM                             (0x00000300U)
#define    FL_FLASH_CODE_MAX_SECTOR_NUM                           (0x000000C0U)
#define    FL_FLASH_CODE_SECTOR_SIZE_BYTE                         (0x00000800U)
#define    FL_FLASH_CODE_PGAE_SIZE_BYTE                           (0x00000200U)
#define    FL_FLASH_CODE_ADDR_MAXPROGRAM                          (0x0005FFFFU)

#define    FL_FLASH_INFO_MAX_PAGE_NUM                             (0x00000004U)
#define    FL_FLASH_IFFO_MAX_SECTOR_NUM                           (0x00000001U)
#define    FL_FLASH_INFO_SECTOR_SIZE_BYTE                         (0x00000800U)
#define    FL_FLASH_INFO_PGAE_SIZE_BYTE                           (0x00000200U)
#define    FL_FLASH_INFO_ADDR_MAXPROGRAM                          (0x000807FFU)
#define    FL_FLASH_INFO_ADDR_MINPROGRAM                          (0x00080000U)

#define    FL_FLASH_DATA_MAX_PAGE_NUM                             (0x00000020U)
#define    FL_FLASH_DATA_MAX_SECTOR_NUM                           (0x00000008U)
#define    FL_FLASH_DATA_SECTOR_SIZE_BYTE                         (0x00000800U)
#define    FL_FLASH_DATA_PGAE_SIZE_BYTE                           (0x00000200U)
#define    FL_FLASH_DATA_ADDR_MAXPROGRAM                          (0xA0003FFFU)
#define    FL_FLASH_DATA_ADDR_MINPROGRAM                          (0xA0000000U)


#define    FL_FLASH_DATA_WAIT_0CYCLE                            (0x0U << FLASH_RDCR_DATA_WAIT_Pos)
#define    FL_FLASH_DATA_WAIT_1CYCLE                            (0x1U << FLASH_RDCR_DATA_WAIT_Pos)
#define    FL_FLASH_DATA_WAIT_2CYCLE                            (0x2U << FLASH_RDCR_DATA_WAIT_Pos)
#define    FL_FLASH_DATA_WAIT_3CYCLE                            (0x3U << FLASH_RDCR_DATA_WAIT_Pos)
#define    FL_FLASH_DATA_WAIT_4CYCLE                            (0x4U << FLASH_RDCR_DATA_WAIT_Pos)
#define    FL_FLASH_DATA_WAIT_5CYCLE                            (0x5U << FLASH_RDCR_DATA_WAIT_Pos)
#define    FL_FLASH_DATA_WAIT_6CYCLE                            (0x6U << FLASH_RDCR_DATA_WAIT_Pos)
#define    FL_FLASH_DATA_WAIT_7CYCLE                            (0x7U << FLASH_RDCR_DATA_WAIT_Pos)


#define    FL_FLASH_CODE_WAIT_0CYCLE                            (0x0U << FLASH_RDCR_CODE_WAIT_Pos)
#define    FL_FLASH_CODE_WAIT_1CYCLE                            (0x1U << FLASH_RDCR_CODE_WAIT_Pos)
#define    FL_FLASH_CODE_WAIT_2CYCLE                            (0x2U << FLASH_RDCR_CODE_WAIT_Pos)

#define    FL_FLASH_IWDT_STOP_UNDER_SLEEP                       (0x0U << FLASH_OPTBR_IWDTSLP_Pos)
#define    FL_FLASH_IWDT_WORK_UNDER_SLEEP                       (0x1U << FLASH_OPTBR_IWDTSLP_Pos)

#define    FL_FLASH_IWDT_STOP_AFTERPOWERON                      (0x0U << FLASH_OPTBR_IWDTEN_Pos)
#define    FL_FLASH_IWDT_WORK_AFTERPOWERON                      (0x1U << FLASH_OPTBR_IWDTEN_Pos)

#define    FL_FLASH_FLASH_LOCK_DISABLE                          (0x0U << FLASH_OPTBR_ACLOCKEN_Pos)
#define    FL_FLASH_FLASH_LOCK_ENABLE                           (0x2U << FLASH_OPTBR_ACLOCKEN_Pos)

#define    FL_FLASH_DFLASH_SWDREAD_PEOTECTION_DISABLE           (0x0U << FLASH_OPTBR_DFDBRDPEN_CODE_Pos)
#define    FL_FLASH_DFLASH_SWDREAD_PEOTECTION_ENABLE            (0x2U << FLASH_OPTBR_DFDBRDPEN_CODE_Pos)

#define    FL_FLASH_CFLASH_SWDREAD_PEOTECTION_DISABLE           (0x0U << FLASH_OPTBR_CFDBRDPEN_CODE_Pos)
#define    FL_FLASH_CFLASH_SWDREAD_PEOTECTION_ENABLE            (0x2U << FLASH_OPTBR_CFDBRDPEN_CODE_Pos)

#define    FL_FLASH_ERASE_TYPE_CODEFLASH_PAGE                   (0x0U << FLASH_CEPCR_ERTYPE_Pos)
#define    FL_FLASH_ERASE_TYPE_CODEFLASH_SECTOR                 (0x1U << FLASH_CEPCR_ERTYPE_Pos)


#define    FL_FLASH_KEY_STATUS_CODEFLASH_LOCK                   (0x0U << FLASH_CISR_KEYSTA_Pos)
#define    FL_FLASH_KEY_STATUS_CODEFLASH_ALL_ERASE              (0x1U << FLASH_CISR_KEYSTA_Pos)
#define    FL_FLASH_KEY_STATUS_CODEFLASH_PAGE_ERASE             (0x2U << FLASH_CISR_KEYSTA_Pos)
#define    FL_FLASH_KEY_STATUS_CODEFLASH_PROGRAM                (0x3U << FLASH_CISR_KEYSTA_Pos)
#define    FL_FLASH_KEY_STATUS_CODEFLASH_ERROR                  (0x4U << FLASH_CISR_KEYSTA_Pos)
#define    FL_FLASH_KEY_STATUS_CODEFLASH_SECTOR_ERASE           (0x5U << FLASH_CISR_KEYSTA_Pos)
 
#define    FL_FLASH_ERASE_TYPE_DATAFLASH_PAGE                   (0x0U << FLASH_DEPCR_ERTYPE_Pos)
#define    FL_FLASH_ERASE_TYPE_DATAFLASH_SECTOR                 (0x1U << FLASH_DEPCR_ERTYPE_Pos)


#define    FL_FLASH_KEY_STATUS_DATAFLASH_LOCK                   (0x0U << FLASH_DISR_KEYSTA_Pos)
#define    FL_FLASH_KEY_STATUS_DATAFLASH_ALL_ERASE              (0x1U << FLASH_DISR_KEYSTA_Pos)
#define    FL_FLASH_KEY_STATUS_DATAFLASH_PAGE_ERASE             (0x2U << FLASH_DISR_KEYSTA_Pos)
#define    FL_FLASH_KEY_STATUS_DATAFLASH_PROGRAM                (0x3U << FLASH_DISR_KEYSTA_Pos)
#define    FL_FLASH_KEY_STATUS_DATAFLASH_ERROR                  (0x4U << FLASH_DISR_KEYSTA_Pos)
#define    FL_FLASH_KEY_STATUS_DATAFLASH_SECTOR_ERASE           (0x5U << FLASH_DISR_KEYSTA_Pos)

/**
  * @}
  */
/* Exported functions ---------------------------------------------------------------------------------*/
/** @defgroup FLASH_FL_Exported_Functions FLASH Exported Functions
  * @{
  */

/**
  * @brief    
  * @rmtoll   RDCR    DATA_WAIT    FL_FLASH_SetDataReadWait
  * @param    FLASHx FLASH instance
  * @param    wait This parameter can be one of the following values:
  *           @arg @ref FL_FLASH_DATA_WAIT_0CYCLE
  *           @arg @ref FL_FLASH_DATA_WAIT_1CYCLE
  *           @arg @ref FL_FLASH_DATA_WAIT_2CYCLE
  *           @arg @ref FL_FLASH_DATA_WAIT_3CYCLE
  *           @arg @ref FL_FLASH_DATA_WAIT_4CYCLE
  *           @arg @ref FL_FLASH_DATA_WAIT_5CYCLE
  *           @arg @ref FL_FLASH_DATA_WAIT_6CYCLE
  *           @arg @ref FL_FLASH_DATA_WAIT_7CYCLE
  * @retval   None
  */
__STATIC_INLINE void FL_FLASH_SetDataReadWait(FLASH_Type* FLASHx, uint32_t wait)
{
    MODIFY_REG(FLASHx->RDCR, FLASH_RDCR_DATA_WAIT_Msk, wait);
}

/**
  * @brief    
  * @rmtoll   RDCR    DATA_WAIT    FL_FLASH_GetDataReadWait
  * @param    FLASHx FLASH instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_FLASH_DATA_WAIT_0CYCLE
  *           @arg @ref FL_FLASH_DATA_WAIT_1CYCLE
  *           @arg @ref FL_FLASH_DATA_WAIT_2CYCLE
  *           @arg @ref FL_FLASH_DATA_WAIT_3CYCLE
  *           @arg @ref FL_FLASH_DATA_WAIT_4CYCLE
  *           @arg @ref FL_FLASH_DATA_WAIT_5CYCLE
  *           @arg @ref FL_FLASH_DATA_WAIT_6CYCLE
  *           @arg @ref FL_FLASH_DATA_WAIT_7CYCLE
  */
__STATIC_INLINE uint32_t FL_FLASH_GetDataReadWait(FLASH_Type* FLASHx)
{
    return (uint32_t)(READ_BIT(FLASHx->RDCR, FLASH_RDCR_DATA_WAIT_Msk));
}

/**
  * @brief    
  * @rmtoll   RDCR    WAIT_STATE    FL_FLASH_SetCodeReadWait
  * @param    FLASHx FLASH instance
  * @param    wait This parameter can be one of the following values:
  *           @arg @ref FL_FLASH_CODE_WAIT_0CYCLE
  *           @arg @ref FL_FLASH_CODE_WAIT_1CYCLE
  *           @arg @ref FL_FLASH_CODE_WAIT_2CYCLE
  * @retval   None
  */
__STATIC_INLINE void FL_FLASH_SetCodeReadWait(FLASH_Type* FLASHx, uint32_t wait)
{
    MODIFY_REG(FLASHx->RDCR, FLASH_RDCR_CODE_WAIT_Msk, wait);
}

/**
  * @brief    
  * @rmtoll   RDCR    WAIT_STATE    FL_FLASH_GetCodeReadWait
  * @param    FLASHx FLASH instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_FLASH_CODE_WAIT_0CYCLE
  *           @arg @ref FL_FLASH_CODE_WAIT_1CYCLE
  *           @arg @ref FL_FLASH_CODE_WAIT_2CYCLE
  */
__STATIC_INLINE uint32_t FL_FLASH_GetCodeReadWait(FLASH_Type* FLASHx)
{
    return (uint32_t)(READ_BIT(FLASHx->RDCR, FLASH_RDCR_CODE_WAIT_Msk));
}

/**
  * @brief    
  * @rmtoll   PFCR    EN    FL_FLASH_EnablePrefetchPhase
  * @param    FLASHx FLASH instance
  * @retval   None
  */
__STATIC_INLINE void FL_FLASH_EnablePrefetchPhase(FLASH_Type* FLASHx)
{
    SET_BIT(FLASHx->PFCR, FLASH_PFCR_EN_Msk);
}

/**
  * @brief    
  * @rmtoll   PFCR    EN    FL_FLASH_DisablePrefetchPhase
  * @param    FLASHx FLASH instance
  * @retval   None
  */
__STATIC_INLINE void FL_FLASH_DisablePrefetchPhase(FLASH_Type* FLASHx)
{
    CLEAR_BIT(FLASHx->PFCR, FLASH_PFCR_EN_Msk);
}

/**
  * @brief    
  * @rmtoll   PFCR    EN    FL_FLASH_IsEnabledPrefetchPhase
  * @param    FLASHx FLASH instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_FLASH_IsEnabledPrefetchPhase(FLASH_Type* FLASHx)
{
    return (uint32_t)(READ_BIT(FLASHx->PFCR, FLASH_PFCR_EN_Msk) == FLASH_PFCR_EN_Msk);
}

/**
  * @brief    
  * @rmtoll   OPTBR    IWDTSLP    FL_FLASH_GetIWDTStateUnderSleep
  * @param    FLASHx FLASH instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_FLASH_IWDT_STOP_UNDER_SLEEP
  *           @arg @ref FL_FLASH_IWDT_WORK_UNDER_SLEEP
  */
__STATIC_INLINE uint32_t FL_FLASH_GetIWDTStateUnderSleep(FLASH_Type* FLASHx)
{
    return (uint32_t)(READ_BIT(FLASHx->OPTBR, FLASH_OPTBR_IWDTSLP_Msk));
}

/**
  * @brief    
  * @rmtoll   OPTBR    IWDTEN    FL_FLASH_GetIWDTStateAfterPowerOn
  * @param    FLASHx FLASH instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_FLASH_IWDT_STOP_AFTERPOWERON
  *           @arg @ref FL_FLASH_IWDT_WORK_AFTERPOWERON
  */
__STATIC_INLINE uint32_t FL_FLASH_GetIWDTStateAfterPowerOn(FLASH_Type* FLASHx)
{
    return (uint32_t)(READ_BIT(FLASHx->OPTBR, FLASH_OPTBR_IWDTEN_Msk));
}

/**
  * @brief    
  * @rmtoll   OPTBR    ACLOCKEN    FL_FLASH_GetFLASHLockState
  * @param    FLASHx FLASH instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_FLASH_FLASH_LOCK_DISABLE
  *           @arg @ref FL_FLASH_FLASH_LOCK_ENABLE
  */
__STATIC_INLINE uint32_t FL_FLASH_GetFLASHLockState(FLASH_Type* FLASHx)
{
    return (uint32_t)(READ_BIT(FLASHx->OPTBR, FLASH_OPTBR_ACLOCKEN_Msk));
}

/**
  * @brief    
  * @rmtoll   OPTBR    DBRDPEN_CODE    FL_FLASH_GetCFLASHSWDReadProtectionState
  * @param    FLASHx FLASH instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_FLASH_CFLASH_SWDREAD_PEOTECTION_DISABLE
  *           @arg @ref FL_FLASH_CFLASH_SWDREAD_PEOTECTION_ENABLE
  */
__STATIC_INLINE uint32_t FL_FLASH_GetCFLASHSWDReadProtectionState(FLASH_Type* FLASHx)
{
    return (uint32_t)(READ_BIT(FLASHx->OPTBR, FLASH_OPTBR_CFDBRDPEN_Msk));
}

/**
  * @brief    
  * @rmtoll   ACLOCK1        FL_FLASH_SetFLASHRegion1Lock
  * @param    FLASHx FLASH instance
  * @param    region This parameter can be one of the following values:
  *           @arg @ref FL_FLASH_BLOCK_0
  *           @arg @ref FL_FLASH_BLOCK_1
  *           @arg @ref FL_FLASH_BLOCK_2
  *           @arg @ref FL_FLASH_BLOCK_3
  *           @arg @ref FL_FLASH_BLOCK_4
  *           @arg @ref FL_FLASH_BLOCK_5
  *           @arg @ref FL_FLASH_BLOCK_6
  *           @arg @ref FL_FLASH_BLOCK_7
  *           @arg @ref FL_FLASH_BLOCK_8
  *           @arg @ref FL_FLASH_BLOCK_9
  *           @arg @ref FL_FLASH_BLOCK_10
  *           @arg @ref FL_FLASH_BLOCK_11
  *           @arg @ref FL_FLASH_BLOCK_12
  *           @arg @ref FL_FLASH_BLOCK_13
  *           @arg @ref FL_FLASH_BLOCK_14
  *           @arg @ref FL_FLASH_BLOCK_15
  * @param    mode This parameter can be one of the following values:
  *           @arg @ref FL_FLASH_LOCK_ALL
  *           @arg @ref FL_FLASH_LOCK_SOFTWARE
  *           @arg @ref FL_FLASH_LOCK_NONE
  * @retval   None
  */
__STATIC_INLINE void FL_FLASH_SetFLASHRegion1Lock(FLASH_Type* FLASHx, uint32_t region, uint32_t mode)
{
    CLEAR_BIT(FLASHx->ACLOCK1, ((region * region) * (((mode == 3) ? 0 : (~mode)) & 0x03)));
}

/**
  * @brief    
  * @rmtoll   ACLOCK1        FL_FLASH_GetFLASHRegion1Lock
  * @param    FLASHx FLASH instance
  * @param    region This parameter can be one of the following values:
  *           @arg @ref FL_FLASH_BLOCK_0
  *           @arg @ref FL_FLASH_BLOCK_1
  *           @arg @ref FL_FLASH_BLOCK_2
  *           @arg @ref FL_FLASH_BLOCK_3
  *           @arg @ref FL_FLASH_BLOCK_4
  *           @arg @ref FL_FLASH_BLOCK_5
  *           @arg @ref FL_FLASH_BLOCK_6
  *           @arg @ref FL_FLASH_BLOCK_7
  *           @arg @ref FL_FLASH_BLOCK_8
  *           @arg @ref FL_FLASH_BLOCK_9
  *           @arg @ref FL_FLASH_BLOCK_10
  *           @arg @ref FL_FLASH_BLOCK_11
  *           @arg @ref FL_FLASH_BLOCK_12
  *           @arg @ref FL_FLASH_BLOCK_13
  *           @arg @ref FL_FLASH_BLOCK_14
  *           @arg @ref FL_FLASH_BLOCK_15
  * @retval   Returned value can be one of the following values:
  */
__STATIC_INLINE uint32_t FL_FLASH_GetFLASHRegion1Lock(FLASH_Type* FLASHx, uint32_t region)
{
    return (uint32_t)(READ_BIT(FLASHx->ACLOCK1, ((region * region) * 0x03)) / (region * region)); 
}

/**
  * @brief    
  * @rmtoll   ACLOCK2        FL_FLASH_SetFLASHRegion2Lock
  * @param    FLASHx FLASH instance
  * @param    region This parameter can be one of the following values:
  *           @arg @ref FL_FLASH_BLOCK_0
  *           @arg @ref FL_FLASH_BLOCK_1
  *           @arg @ref FL_FLASH_BLOCK_2
  *           @arg @ref FL_FLASH_BLOCK_3
  *           @arg @ref FL_FLASH_BLOCK_4
  *           @arg @ref FL_FLASH_BLOCK_5
  *           @arg @ref FL_FLASH_BLOCK_6
  *           @arg @ref FL_FLASH_BLOCK_7
  *           @arg @ref FL_FLASH_BLOCK_8
  *           @arg @ref FL_FLASH_BLOCK_9
  *           @arg @ref FL_FLASH_BLOCK_10
  *           @arg @ref FL_FLASH_BLOCK_11
  *           @arg @ref FL_FLASH_BLOCK_12
  *           @arg @ref FL_FLASH_BLOCK_13
  *           @arg @ref FL_FLASH_BLOCK_14
  *           @arg @ref FL_FLASH_BLOCK_15
  * @param    mode This parameter can be one of the following values:
  *           @arg @ref FL_FLASH_LOCK_ALL
  *           @arg @ref FL_FLASH_LOCK_SOFTWARE
  *           @arg @ref FL_FLASH_LOCK_NONE
  * @retval   None
  */
__STATIC_INLINE void FL_FLASH_SetFLASHRegion2Lock(FLASH_Type* FLASHx, uint32_t region, uint32_t mode)
{
    CLEAR_BIT(FLASHx->ACLOCK2, ((region * region) * (((mode == 3) ? 0 : (~mode)) & 0x03))); 
}

/**
  * @brief    
  * @rmtoll   ACLOCK2        FL_FLASH_GetFLASHRegion2Lock
  * @param    FLASHx FLASH instance
  * @param    region This parameter can be one of the following values:
  *           @arg @ref FL_FLASH_BLOCK_0
  *           @arg @ref FL_FLASH_BLOCK_1
  *           @arg @ref FL_FLASH_BLOCK_2
  *           @arg @ref FL_FLASH_BLOCK_3
  *           @arg @ref FL_FLASH_BLOCK_4
  *           @arg @ref FL_FLASH_BLOCK_5
  *           @arg @ref FL_FLASH_BLOCK_6
  *           @arg @ref FL_FLASH_BLOCK_7
  *           @arg @ref FL_FLASH_BLOCK_8
  *           @arg @ref FL_FLASH_BLOCK_9
  *           @arg @ref FL_FLASH_BLOCK_10
  *           @arg @ref FL_FLASH_BLOCK_11
  *           @arg @ref FL_FLASH_BLOCK_12
  *           @arg @ref FL_FLASH_BLOCK_13
  *           @arg @ref FL_FLASH_BLOCK_14
  *           @arg @ref FL_FLASH_BLOCK_15
  * @retval   Returned value can be one of the following values:
  */
__STATIC_INLINE uint32_t FL_FLASH_GetFLASHRegion2Lock(FLASH_Type* FLASHx, uint32_t region)
{
    return (uint32_t)(READ_BIT(FLASHx->ACLOCK2, ((region * region) * 0x03)) / (region * region));
}

/**
  * @brief    
  * @rmtoll   ACLOCK3        FL_FLASH_SetFLASHRegion3Lock
  * @param    FLASHx FLASH instance
  * @param    region This parameter can be one of the following values:
  *           @arg @ref FL_FLASH_BLOCK_0
  *           @arg @ref FL_FLASH_BLOCK_1
  *           @arg @ref FL_FLASH_BLOCK_2
  *           @arg @ref FL_FLASH_BLOCK_3
  *           @arg @ref FL_FLASH_BLOCK_4
  *           @arg @ref FL_FLASH_BLOCK_5
  *           @arg @ref FL_FLASH_BLOCK_6
  *           @arg @ref FL_FLASH_BLOCK_7
  *           @arg @ref FL_FLASH_BLOCK_8
  *           @arg @ref FL_FLASH_BLOCK_9
  *           @arg @ref FL_FLASH_BLOCK_10
  *           @arg @ref FL_FLASH_BLOCK_11
  *           @arg @ref FL_FLASH_BLOCK_12
  *           @arg @ref FL_FLASH_BLOCK_13
  *           @arg @ref FL_FLASH_BLOCK_14
  *           @arg @ref FL_FLASH_BLOCK_15
  * @param    mode This parameter can be one of the following values:
  *           @arg @ref FL_FLASH_LOCK_ALL
  *           @arg @ref FL_FLASH_LOCK_SOFTWARE
  *           @arg @ref FL_FLASH_LOCK_NONE
  * @retval   None
  */
__STATIC_INLINE void FL_FLASH_SetFLASHRegion3Lock(FLASH_Type* FLASHx, uint32_t region, uint32_t mode)
{
     CLEAR_BIT(FLASHx->ACLOCK3, ((region * region) * (((mode == 3) ? 0 : (~mode)) & 0x03))); 
}

/**
  * @brief    
  * @rmtoll   ACLOCK3        FL_FLASH_GetFLASHRegion3Lock
  * @param    FLASHx FLASH instance
  * @param    region This parameter can be one of the following values:
  *           @arg @ref FL_FLASH_BLOCK_0
  *           @arg @ref FL_FLASH_BLOCK_1
  *           @arg @ref FL_FLASH_BLOCK_2
  *           @arg @ref FL_FLASH_BLOCK_3
  *           @arg @ref FL_FLASH_BLOCK_4
  *           @arg @ref FL_FLASH_BLOCK_5
  *           @arg @ref FL_FLASH_BLOCK_6
  *           @arg @ref FL_FLASH_BLOCK_7
  *           @arg @ref FL_FLASH_BLOCK_8
  *           @arg @ref FL_FLASH_BLOCK_9
  *           @arg @ref FL_FLASH_BLOCK_10
  *           @arg @ref FL_FLASH_BLOCK_11
  *           @arg @ref FL_FLASH_BLOCK_12
  *           @arg @ref FL_FLASH_BLOCK_13
  *           @arg @ref FL_FLASH_BLOCK_14
  *           @arg @ref FL_FLASH_BLOCK_15
  * @retval   Returned value can be one of the following values:
  */
__STATIC_INLINE uint32_t FL_FLASH_GetFLASHRegion3Lock(FLASH_Type* FLASHx, uint32_t region)
{
     return (uint32_t)(READ_BIT(FLASHx->ACLOCK3, ((region * region) * 0x03)) / (region * region));
}

/**
  * @brief    
  * @rmtoll   CEPCR    ERTYPE    FL_FLASH_SetCodeFLASHEraseType
  * @param    FLASHx FLASH instance
  * @param    type This parameter can be one of the following values:
  *           @arg @ref FL_FLASH_ERASE_TYPE_PAGE
  *           @arg @ref FL_FLASH_ERASE_TYPE_SECTOR
  * @retval   None
  */
__STATIC_INLINE void FL_FLASH_SetCodeFLASHEraseType(FLASH_Type* FLASHx, uint32_t type)
{
    MODIFY_REG(FLASHx->CEPCR, FLASH_CEPCR_ERTYPE_Msk, type);
}

/**
  * @brief    
  * @rmtoll   CEPCR    ERTYPE    FL_FLASH_GetCodeFLASHEraseType
  * @param    FLASHx FLASH instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_FLASH_ERASE_TYPE_PAGE
  *           @arg @ref FL_FLASH_ERASE_TYPE_SECTOR
  */
__STATIC_INLINE uint32_t FL_FLASH_GetCodeFLASHEraseType(FLASH_Type* FLASHx)
{
    return (uint32_t)(READ_BIT(FLASHx->CEPCR, FLASH_CEPCR_ERTYPE_Msk));
}

/**
  * @brief    
  * @rmtoll   CEPCR    PREQ    FL_FLASH_EnableProgramInCodeFLASH
  * @param    FLASHx FLASH instance
  * @retval   None
  */
__STATIC_INLINE void FL_FLASH_EnableProgramInCodeFLASH(FLASH_Type* FLASHx)
{
    CLEAR_BIT(FLASHx->CEPCR, FLASH_CEPCR_EREQ_Msk);
    SET_BIT(FLASHx->CEPCR, FLASH_CEPCR_PREQ_Msk);
}

/**
  * @brief    
  * @rmtoll   CEPCR    EREQ    FL_FLASH_EnableEraseInCodeFLASH
  * @param    FLASHx FLASH instance
  * @retval   None
  */
__STATIC_INLINE void FL_FLASH_EnableEraseInCodeFLASH(FLASH_Type* FLASHx)
{
   CLEAR_BIT(FLASHx->CEPCR, FLASH_CEPCR_PREQ_Msk);
    SET_BIT(FLASHx->CEPCR, FLASH_CEPCR_EREQ_Msk);  
}

/**
  * @brief    
  * @rmtoll   CKEY        FL_FLASH_UnlockCodeFLASH
  * @param    FLASHx FLASH instance
  * @param    key 
  * @retval   None
  */
__STATIC_INLINE void FL_FLASH_UnlockCodeFLASH(FLASH_Type* FLASHx, uint32_t key)
{
   WRITE_REG(FLASHx->CKEY, key); 
}

/**
  * @brief    
  * @rmtoll   CKEY        FL_FLASH_LockCodeFLASH
  * @param    FLASHx FLASH instance
  * @retval   None
  */
__STATIC_INLINE void FL_FLASH_LockCodeFLASH(FLASH_Type* FLASHx)
{
    WRITE_REG(FLASHx->CKEY, 0xFFFFFFFF);
}

/**
  * @brief    
  * @rmtoll   CIER    LVIE    FL_FLASH_EnableIT_Voltage detectProgramErrorInCodeFLASH
  * @param    FLASHx FLASH instance
  * @retval   None
  */
__STATIC_INLINE void FL_FLASH_EnableIT_VoltageDetectProgramErrorInCodeFlash(FLASH_Type* FLASHx)
{
    SET_BIT(FLASHx->CIER, FLASH_CIER_LVIE_Msk);
}

/**
  * @brief    
  * @rmtoll   CIER    LVIE    FL_FLASH_DisableIT_Voltage detectProgramErrorInCodeFLASH
  * @param    FLASHx FLASH instance
  * @retval   None
  */
__STATIC_INLINE void FL_FLASH_DisableIT_VoltageDetectProgramErrorInCodeFLASH(FLASH_Type* FLASHx)
{
    CLEAR_BIT(FLASHx->CIER, FLASH_CIER_LVIE_Msk);
}

/**
  * @brief    
  * @rmtoll   CIER    LVIE    FL_FLASH_IsEnabledIT_Voltage detectProgramErrorInCodeFLASH
  * @param    FLASHx FLASH instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_FLASH_IsEnabledIT_VoltageDetectProgramErrorInCodeFLASH(FLASH_Type* FLASHx)
{
    return (uint32_t)(READ_BIT(FLASHx->CIER, FLASH_CIER_LVIE_Msk) == FLASH_CIER_LVIE_Msk);
}

/**
  * @brief    
  * @rmtoll   CIER    OPTIE    FL_FLASH_EnableIT_OTPProgramErrorInCodeFLASH
  * @param    FLASHx FLASH instance
  * @retval   None
  */
__STATIC_INLINE void FL_FLASH_EnableIT_OTPProgramErrorInCodeFLASH(FLASH_Type* FLASHx)
{
    SET_BIT(FLASHx->CIER, FLASH_CIER_OPTIE_Msk);
}

/**
  * @brief    
  * @rmtoll   CIER    OPTIE    FL_FLASH_DisableIT_OTPProgramErrorInCodeFLASH
  * @param    FLASHx FLASH instance
  * @retval   None
  */
__STATIC_INLINE void FL_FLASH_DisableIT_OTPProgramErrorInCodeFLASH(FLASH_Type* FLASHx)
{
    CLEAR_BIT(FLASHx->CIER, FLASH_CIER_OPTIE_Msk);
}

/**
  * @brief    
  * @rmtoll   CIER    OPTIE    FL_FLASH_IsEnabledIT_OTPProgramErrorInCodeFLASH
  * @param    FLASHx FLASH instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_FLASH_IsEnabledIT_OTPProgramErrorInCodeFLASH(FLASH_Type* FLASHx)
{
    return (uint32_t)(READ_BIT(FLASHx->CIER, FLASH_CIER_OPTIE_Msk) == FLASH_CIER_OPTIE_Msk);
}

/**
  * @brief    
  * @rmtoll   CIER    AUTHIE    FL_FLASH_EnableIT_AuthenticationErrorInCodeFLASH
  * @param    FLASHx FLASH instance
  * @retval   None
  */
__STATIC_INLINE void FL_FLASH_EnableIT_AuthenticationErrorInCodeFLASH(FLASH_Type* FLASHx)
{
    SET_BIT(FLASHx->CIER, FLASH_CIER_AUTHIE_Msk);
}

/**
  * @brief    
  * @rmtoll   CIER    AUTHIE    FL_FLASH_DisableIT_AuthenticationErrorInCodeFLASH
  * @param    FLASHx FLASH instance
  * @retval   None
  */
__STATIC_INLINE void FL_FLASH_DisableIT_AuthenticationErrorInCodeFLASH(FLASH_Type* FLASHx)
{
    CLEAR_BIT(FLASHx->CIER, FLASH_CIER_AUTHIE_Msk);
}

/**
  * @brief    
  * @rmtoll   CIER    AUTHIE    FL_FLASH_IsEnabledIT_AuthenticationErrorInCodeFLASH
  * @param    FLASHx FLASH instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_FLASH_IsEnabledIT_AuthenticationErrorInCodeFLASH(FLASH_Type* FLASHx)
{
    return (uint32_t)(READ_BIT(FLASHx->CIER, FLASH_CIER_AUTHIE_Msk) == FLASH_CIER_AUTHIE_Msk);
}

/**
  * @brief    
  * @rmtoll   CIER    KEYIE    FL_FLASH_EnableIT_KeyErrorInCodeFLASH
  * @param    FLASHx FLASH instance
  * @retval   None
  */
__STATIC_INLINE void FL_FLASH_EnableIT_KeyErrorInCodeFLASH(FLASH_Type* FLASHx)
{
    SET_BIT(FLASHx->CIER, FLASH_CIER_KEYIE_Msk);
}

/**
  * @brief    
  * @rmtoll   CIER    KEYIE    FL_FLASH_DisableIT_KeyErrorInCodeFLASH
  * @param    FLASHx FLASH instance
  * @retval   None
  */
__STATIC_INLINE void FL_FLASH_DisableIT_KeyErrorInCodeFLASH(FLASH_Type* FLASHx)
{
    CLEAR_BIT(FLASHx->CIER, FLASH_CIER_KEYIE_Msk);
}

/**
  * @brief    
  * @rmtoll   CIER    KEYIE    FL_FLASH_IsEnabledIT_KeyErrorInCodeFLASH
  * @param    FLASHx FLASH instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_FLASH_IsEnabledIT_KeyErrorInCodeFLASH(FLASH_Type* FLASHx)
{
    return (uint32_t)(READ_BIT(FLASHx->CIER, FLASH_CIER_KEYIE_Msk) == FLASH_CIER_KEYIE_Msk);
}

/**
  * @brief    
  * @rmtoll   CIER    CKIE    FL_FLASH_EnableIT_ClockErrorInCodeFLASH
  * @param    FLASHx FLASH instance
  * @retval   None
  */
__STATIC_INLINE void FL_FLASH_EnableIT_ClockErrorInCodeFLASH(FLASH_Type* FLASHx)
{
    SET_BIT(FLASHx->CIER, FLASH_CIER_CKIE_Msk);
}

