GUdaoxi/demo_qspi/LPTIM16_Timing/Drivers/FM33FH0xx_FL_Driver/Inc/fm33fh0xx_fl_flash.h
/**
  * @brief    
  * @rmtoll   DIER    CKIE    FL_FLASH_IsEnabledIT_ClockErrorInDataFLASH
  * @param    FLASHx FLASH instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_FLASH_IsEnabledIT_ClockErrorInDataFLASH(FLASH_Type* FLASHx)
{
    return (uint32_t)(READ_BIT(FLASHx->DIER, FLASH_DIER_CKIE_Msk) == FLASH_DIER_CKIE_Msk);
}

/**
  * @brief    
  * @rmtoll   DIER    PRDIE    FL_FLASH_EnableIT_ProgramCompleteInDataFLASH
  * @param    FLASHx FLASH instance
  * @retval   None
  */
__STATIC_INLINE void FL_FLASH_EnableIT_ProgramCompleteInDataFLASH(FLASH_Type* FLASHx)
{
    SET_BIT(FLASHx->DIER, FLASH_DIER_PRDIE_Msk);
}

/**
  * @brief    
  * @rmtoll   DIER    PRDIE    FL_FLASH_DisableIT_ProgramCompleteInDataFLASH
  * @param    FLASHx FLASH instance
  * @retval   None
  */
__STATIC_INLINE void FL_FLASH_DisableIT_ProgramCompleteInDataFLASH(FLASH_Type* FLASHx)
{
    CLEAR_BIT(FLASHx->DIER, FLASH_DIER_PRDIE_Msk);
}

/**
  * @brief    
  * @rmtoll   DIER    PRDIE    FL_FLASH_IsEnabledIT_ProgramCompleteInDataFLASH
  * @param    FLASHx FLASH instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_FLASH_IsEnabledIT_ProgramCompleteInDataFLASH(FLASH_Type* FLASHx)
{
    return (uint32_t)(READ_BIT(FLASHx->DIER, FLASH_DIER_PRDIE_Msk) == FLASH_DIER_PRDIE_Msk);
}

/**
  * @brief    
  * @rmtoll   DIER    ERDIE    FL_FLASH_EnableIT_EraseCompleteInDataFLASH
  * @param    FLASHx FLASH instance
  * @retval   None
  */
__STATIC_INLINE void FL_FLASH_EnableIT_EraseCompleteInDataFLASH(FLASH_Type* FLASHx)
{
    SET_BIT(FLASHx->DIER, FLASH_DIER_ERDIE_Msk);
}

/**
  * @brief    
  * @rmtoll   DIER    ERDIE    FL_FLASH_DisableIT_EraseCompleteInDataFLASH
  * @param    FLASHx FLASH instance
  * @retval   None
  */
__STATIC_INLINE void FL_FLASH_DisableIT_EraseCompleteInDataFLASH(FLASH_Type* FLASHx)
{
    CLEAR_BIT(FLASHx->DIER, FLASH_DIER_ERDIE_Msk);
}

/**
  * @brief    
  * @rmtoll   DIER    ERDIE    FL_FLASH_IsEnabledIT_EraseCompleteInDataFLASH
  * @param    FLASHx FLASH instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_FLASH_IsEnabledIT_EraseCompleteInDataFLASH(FLASH_Type* FLASHx)
{
    return (uint32_t)(READ_BIT(FLASHx->DIER, FLASH_DIER_ERDIE_Msk) == FLASH_DIER_ERDIE_Msk);
}

/**
  * @brief    
  * @rmtoll   DISR    CONF    FL_FLASH_IsActiveFlag_TestModeInDataFLASH
  * @param    FLASHx FLASH instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_FLASH_IsActiveFlag_TestModeInDataFLASH(FLASH_Type* FLASHx)
{
    return (uint32_t)(READ_BIT(FLASHx->DISR, FLASH_DISR_CONF_Msk) == (FLASH_DISR_CONF_Msk));
}

/**
  * @brief    
  * @rmtoll   DISR    KEYSTA    FL_FLASH_GetFLASHLockStatusInDataFLASH
  * @param    FLASHx FLASH instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_FLASH_KEY_STATUS_LOCK
  *           @arg @ref FL_FLASH_KEY_STATUS_ALL_ERASE
  *           @arg @ref FL_FLASH_KEY_STATUS_PAGE_ERASE
  *           @arg @ref FL_FLASH_KEY_STATUS_PROGRAM
  *           @arg @ref FL_FLASH_KEY_STATUS_ERROR
  *           @arg @ref FL_FLASH_KEY_STATUS_SECTOR_ERASE
  */
__STATIC_INLINE uint32_t FL_FLASH_GetFLASHLockStatusInDataFLASH(FLASH_Type* FLASHx)
{
    return (uint32_t)(READ_BIT(FLASHx->DISR, FLASH_DISR_KEYSTA_Msk));
}

/**
  * @brief    
  * @rmtoll   DISR    LVERR    FL_FLASH_IsActiveFlag_SVDVoltagedetectFallingErrorInDataFLASH
  * @param    FLASHx FLASH instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_FLASH_IsActiveFlag_SVDVoltagedetectFallingErrorInDataFLASH(FLASH_Type* FLASHx)
{
    return (uint32_t)(READ_BIT(FLASHx->DISR, FLASH_DISR_LVERR_Msk) == (FLASH_DISR_LVERR_Msk));
}

/**
  * @brief    
  * @rmtoll   DISR    LVERR    FL_FLASH_ClearFlag_SVDVoltagedetectFallingErrorInDataFLASH
  * @param    FLASHx FLASH instance
  * @retval   None
  */
__STATIC_INLINE void FL_FLASH_ClearFlag_SVDVoltagedetectFallingErrorInDataFLASH(FLASH_Type* FLASHx)
{
    WRITE_REG(FLASHx->DISR, FLASH_DISR_LVERR_Msk);
}

/**
  * @brief    
  * @rmtoll   DISR    AUTHERR    FL_FLASH_IsActiveFlag_AuthenticationErrorInDataFLASH
  * @param    FLASHx FLASH instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_FLASH_IsActiveFlag_AuthenticationErrorInDataFLASH(FLASH_Type* FLASHx)
{
    return (uint32_t)(READ_BIT(FLASHx->DISR, FLASH_DISR_AUTHERR_Msk) == (FLASH_DISR_AUTHERR_Msk));
}

/**
  * @brief    
  * @rmtoll   DISR    AUTHERR    FL_FLASH_ClearFlag_AuthenticationErrorInDataFLASH
  * @param    FLASHx FLASH instance
  * @retval   None
  */
__STATIC_INLINE void FL_FLASH_ClearFlag_AuthenticationErrorInDataFLASH(FLASH_Type* FLASHx)
{
    WRITE_REG(FLASHx->DISR, FLASH_DISR_AUTHERR_Msk);
}

/**
  * @brief    
  * @rmtoll   DISR    KEYERR    FL_FLASH_IsActiveFlag_KeyErrorInDataFLASH
  * @param    FLASHx FLASH instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_FLASH_IsActiveFlag_KeyErrorInDataFLASH(FLASH_Type* FLASHx)
{
    return (uint32_t)(READ_BIT(FLASHx->DISR, FLASH_DISR_KEYERR_Msk) == (FLASH_DISR_KEYERR_Msk));
}

/**
  * @brief    
  * @rmtoll   DISR    KEYERR    FL_FLASH_ClearFlag_KeyErrorInDataFLASH
  * @param    FLASHx FLASH instance
  * @retval   None
  */
__STATIC_INLINE void FL_FLASH_ClearFlag_KeyErrorInDataFLASH(FLASH_Type* FLASHx)
{
    WRITE_REG(FLASHx->DISR, FLASH_DISR_KEYERR_Msk);
}

/**
  * @brief    
  * @rmtoll   DISR    CKERR    FL_FLASH_IsActiveFlag_ClockErrorInDataFLASH
  * @param    FLASHx FLASH instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_FLASH_IsActiveFlag_ClockErrorInDataFLASH(FLASH_Type* FLASHx)
{
    return (uint32_t)(READ_BIT(FLASHx->DISR, FLASH_DISR_CKERR_Msk) == (FLASH_DISR_CKERR_Msk));
}

/**
  * @brief    
  * @rmtoll   DISR    CKERR    FL_FLASH_ClearFlag_ClockErrorInDataFLASH
  * @param    FLASHx FLASH instance
  * @retval   None
  */
__STATIC_INLINE void FL_FLASH_ClearFlag_ClockErrorInDataFLASH(FLASH_Type* FLASHx)
{
    WRITE_REG(FLASHx->DISR, FLASH_DISR_CKERR_Msk);
}

/**
  * @brief    
  * @rmtoll   DISR    PRD    FL_FLASH_IsActiveFlag_ProgramCompleteInDataFLASH
  * @param    FLASHx FLASH instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_FLASH_IsActiveFlag_ProgramCompleteInDataFLASH(FLASH_Type* FLASHx)
{
    return (uint32_t)(READ_BIT(FLASHx->DISR, FLASH_DISR_PRD_Msk) == (FLASH_DISR_PRD_Msk));
}

/**
  * @brief    
  * @rmtoll   DISR    PRD    FL_FLASH_ClearFlag_ProgramCompleteInDataFLASH
  * @param    FLASHx FLASH instance
  * @retval   None
  */
__STATIC_INLINE void FL_FLASH_ClearFlag_ProgramCompleteInDataFLASH(FLASH_Type* FLASHx)
{
    WRITE_REG(FLASHx->DISR, FLASH_DISR_PRD_Msk);
}

/**
  * @brief    
  * @rmtoll   DISR    ERD    FL_FLASH_IsActiveFlag_EraseCompleteInDataFLASH
  * @param    FLASHx FLASH instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_FLASH_IsActiveFlag_EraseCompleteInDataFLASH(FLASH_Type* FLASHx)
{
    return (uint32_t)(READ_BIT(FLASHx->DISR, FLASH_DISR_ERD_Msk) == (FLASH_DISR_ERD_Msk));
}

/**
  * @brief    
  * @rmtoll   DISR    ERD    FL_FLASH_ClearFlag_EraseCompleteInDataFLASH
  * @param    FLASHx FLASH instance
  * @retval   None
  */
__STATIC_INLINE void FL_FLASH_ClearFlag_EraseCompleteInDataFLASH(FLASH_Type* FLASHx)
{
    WRITE_REG(FLASHx->DISR, FLASH_DISR_ERD_Msk);
}

/**
  * @}
  */

/** @defgroup FLASH_FL_EF_Init Initialization and de-initialization functions
  * @{
  */

/**
  * @}
  */

FL_ErrorStatus FL_FLASH_CodePageErase(FLASH_Type *FLASHx, uint32_t address);
FL_ErrorStatus FL_FLASH_CodeSectorErase(FLASH_Type *FLASHx, uint32_t address);
FL_ErrorStatus FL_FLASH_CodeProgram_Word(FLASH_Type *FLASHx, uint32_t address, uint32_t data);
FL_ErrorStatus FL_FLASH_CodeProgram_Page(FLASH_Type *FLASHx, uint32_t pageNum, uint32_t *data);
FL_ErrorStatus FL_FLASH_CodeProgram_Sector(FLASH_Type *FLASHx, uint32_t sectorNum, uint32_t *data);
FL_ErrorStatus FL_FLASH_DataPageErase(FLASH_Type *FLASHx, uint32_t address);
FL_ErrorStatus FL_FLASH_DataSectorErase(FLASH_Type *FLASHx, uint32_t address);
FL_ErrorStatus FL_FLASH_DataProgram_Word(FLASH_Type *FLASHx, uint32_t address, uint32_t data);
FL_ErrorStatus FL_FLASH_DataProgram_Page(FLASH_Type *FLASHx, uint32_t pageNum, uint32_t *data);
FL_ErrorStatus FL_FLASH_DataProgram_Sector(FLASH_Type *FLASHx, uint32_t sectorNum, uint32_t *data);


/**
  * @}
  */

#ifdef __cplusplus
}
#endif

#endif /* __FM33FH0XX_FL_FLASH_H*/

/*************************Py_Code_Generator Version: 0.1-0.14-0.1 @ 2024-02-22*************************/
/*************************(C) COPYRIGHT Fudan Microelectronics **** END OF FILE*************************/
